app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asd"], ["category", "Action"], ["created_at", "2020-09-11 14:01:53.365855"], ["updated_at", "2020-09-11 14:01:53.365855"]]